[
    [
        "users",
        "Entrepreneurship Jobs for All (E-Jobs4All)",
        "<div>The Entrepreneurship Jobs for All (E-Jobs4All) program will set the Ghanaian youth up to build and grow their businesses. Successful applicants will receive free entrepreneurship and innovation training from Queens University Dunin-Deshpande Innovation Centre (DDQIC) in Canada, advisory services from business experts in the Leadogo Incorporated network and in-person training at JACCD Design Institute Africa. <br>Apply now through September 30, 2022 to be part of this great program. This is your chance for free access to a year practical entrepreneurship and innovation training course from Queen’s University, a public research university in Kingston, Ontario, Canada, the 2022 Times Higher Education Impact Ranking best university in Canada and 7h in the World advancing the United Nations Sustainable Development Goal.<h6 class=\"mt-3\"><i>Criteria</i></h6><ul><li>• Open to students, SMEs, aspiring entrepreneurs, startups, unemployed and fresh graduates who want to start, build and scale up their own businesses.</li><li>• Must be a Ghanaian</li><li>• Be proficient in reading, writing and speaking English</li><li>• Must be ready and willing to pursue online/virtual training</li></ul><h6 class=\"mt-3\"><i>Benefit </i></h6><ul><li>• Fully funded opportunity to learn entrepreneurship and innovation from a world class university, build skills and network with young global and business leaders.</li><li>• Participate in an in-person training to share your experience with and learn from Queen's University DDQIC faculty members, Ghanaian, Canadian business experts and fellows. Meet with civic and business leaders and strengthen your work through new connections, skills and ideas.</li><li>• Participate in a summit and Dunin-Deshpande Queen's Innovation Centre lecture series. Network with Queen's Innovation Centre Summer Initiative (QICSI) and Jim Leech MasterCard Foundation fellows. Join an alumni network to help you seek innovative solutions to common challenges. Explore industries beyond your daily work and expand your expertise.</li></ul><h6 class=\"mt-3\"><i>Application Timeline</i></h6><ul><li>• August 31, 2022 | Application opens</li><li>• September 30, 2022 | Application closes</li><li>• October 2 - 30, 2022 | Interview and Selection</li><li>• November 1 - 30, 2022 | Notification of Selected Applicants </li></ul><br><a href=\"./e-jobs-4-all\" class=\"btn btn-sm btn-dark\">Apply Now</a></div>"
    ],
    [
        "building",
        "Fellowship Programme",
        "This fellowship programme develop the next generation of global leaders through leadership training and\r\nmentorship. It is a one year leadership development programme designed to connect and develop young\r\nglobal leaders to make a lasting contribution to their communities."
    ],
    [
        "building",
        "LED Programme",
        "The Leadership and Entrepreneurship Development Programme as commonly called LED programme also\r\ntrains, mentor and provide funding opportunities to unemployed youth and start-up entrepreneurs. This\r\nprogramme provides a week residential training, a year- long tailored package of online learning,\r\nmentoring, networking and funding. \u003Cbr\/\u003E \u003Cbr\/\u003E \u003Cbutton onClick=\"window.location='https:\/\/play.google.com\/store\/apps\/details?id=org.cedi.ghana.ledpro'\" class=\"btn btn-sm btn-dark\"\u003EGet From Play Store\u003C\/button\u003E"
    ]
]